OpenFoam Final Project/mach-3-ramp-20-N/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          32;
        startFace       9040;
    }
    outlet
    {
        type            patch;
        nFaces          32;
        startFace       9072;
    }
    bottom
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          24;
        startFace       9104;
    }
    top
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          24;
        startFace       9128;
    }
    obstacle
    {
        type            patch;
        nFaces          240;
        startFace       9152;
    }
    defaultFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          9216;
        startFace       9392;
    }
)

// ************************************************************************* //
